Dlubal.RFEM5.ResultsValueType
Type of result values.

Dlubal.RFEM5.ResultsValueType.UnknownValueType
Unknown results

Dlubal.RFEM5.ResultsValueType.StandardValueType
Standard results

Dlubal.RFEM5.ResultsValueType.MaximumValueType
Maximum results

Dlubal.RFEM5.ResultsValueType.MinimumValueType
Minimum results

Dlubal.RFEM5.ResultsValueType.MaximumAlongX
Maximum value in direction along X-axis.

Dlubal.RFEM5.ResultsValueType.MinimumAlongX
Minimum value in direction along X-axis.

Dlubal.RFEM5.ResultsValueType.MaximumAlongY
Maximum value in direction along Y-axis.

Dlubal.RFEM5.ResultsValueType.MinimumAlongY
Minimum value in direction along Y-axis.

Dlubal.RFEM5.ResultsValueType.MaximumAlongZ
Maximum value in direction along Z-axis.

Dlubal.RFEM5.ResultsValueType.MinimumAlongZ
Minimum value in direction along Z-axis.

Dlubal.RFEM5.ResultsValueType.MaximumAroundX
Maximum value in direction about X-axis.

Dlubal.RFEM5.ResultsValueType.MinimumAroundX
Minimum value in direction about X-axis.

Dlubal.RFEM5.ResultsValueType.MaximumAroundY
Maximum value in direction about Y-axis.

Dlubal.RFEM5.ResultsValueType.MinimumAroundY
Minimum value in direction about Y-axis.

Dlubal.RFEM5.ResultsValueType.MaximumAroundZ
Maximum value in direction about Z-axis.

Dlubal.RFEM5.ResultsValueType.MinimumAroundZ
Minimum value in direction about Z-axis.